import Vue from 'vue'
Vue.prototype.$enum = { //仓库枚举类型
    //物流公司
    logistics: {
        sf : '顺丰',
        sto: '申通',
        yt: '圆通',
        yd: '韵达',
        tt: '天天',
        ems: 'EMS',
        zto: '中通',
        ht: '汇通',
        qf: '全峰',
        db: '德邦',
        gt: '国通',
        rfd: '如风达',
        jd: '京东快递',
        zjs: '宅急送',
        emsg: 'EMS国际',
        fedex: 'Fedex国际',
        yzgn: '邮政国内',
        ups: 'UPS国际快递',
        ztky: '中铁快运',
        jiaji: '佳吉快运',
        suer: '速尔快递',
        xfwl: '信丰物流',
        yousu: '优速快递',
        zhongyou: '中邮物流',
        tdhy: '天地华宇',
        axd: '安信达快递',
        kuaijie: '快捷速递'
    },
	//库存变更类型
	changeType: {
		0: '普通进货单',
		1: '调拨进货单',
		2: '普通出库',
		3: '调拨出库',
		4: '采购退货',
		5: '调拨退货',
		6: '寄存存件',
		7: '寄存取件',
		8: '盘点 ',
		9: '报损',
		10: '编辑',
		11: '客户退货'
	},
	//采购单状态
	orderStatus: {
		0: '待入库',
		1: '完成',
		2: '作废'
	},
	//促销活动类型
	activityType: {
		1: '满额返现',
		2: '打折促销',
		3: '套餐促销'
	},
	//货单类型
	logisticsType: {
		0: '普通进货单',
		1: '调拨进货单',
		2: '普通出库',
		3: '调拨出库',
		4: '采购退货',
		5: '调拨退货'
	},
	//供应商结算状态
	supplierSumStaus: {
		0: '未成功货单',
		1: '待对账货单',
		2: '待结算货单',
		3: '已结算货单'
	},
	//货流状态 0待 1完成 2拒绝（只有进货能拒绝） 3退货完成(对完成的调拨退货进行操作)
	logisticsStatus: {
		0: '待完成',
		1: '已完成',
		2: '拒绝',
		3: '退货完成'
	},
	//出库类型
	outStockType:{
		2: '普通出库',
		4: '采购退货',
		5: '调拨退货'
	},
	//出库价格
	outStockPrice:{
		0: '以最近进货价出库',
		1: '以平均进货价出库',
		2: '以商品销售价出库',
	},
	//调货价格
	shipStockPrice:{
		0: '以商品进货价调货',
		1: '以商品销售价调货',
		2: '以商品批发价调货',
	},
	//支付方式
	payType: {
		1: '现金',
		2: '刷卡',
		3: '支付宝',
		4: '微信',
		5: '会员卡',
		9: '组合付款'
	},
	//销售单状态
	saleOderStatus: {
		1: '有效单据',
		2: '作废单据',
		3: '退货单据',
		4: '会员单据'
	}
}
